Repository: flutter-news-app-full-source-code/ui-kit
Catalog: lib/l10n/app_*.arb
Languages: ar

# networkError
source: Please check your internet connection.
ar: يرجى التحقق من اتصالك بالإنترنت.

# serverError
source: A server error occurred. Please try again later.
ar: حدث خطأ في الخادم. يرجى المحاولة مرة أخرى لاحقًا.

# unknownError
source: An unknown error occurred.
ar: حدث خطأ غير معروف.

# operationFailedError
source: The operation could not be completed.
ar: تعذرت إتمام العملية.

# forbiddenError
source: You do not have permission to perform this action.
ar: ليس لديك الإذن لتنفيذ هذا الإجراء.

# unauthorizedError
source: Your session may have expired. Please try signing in again.
ar: قد تكون جلستك قد انتهت. يرجى محاولة تسجيل الدخول مرة أخرى.

# notFoundError
source: The requested item could not be found.
ar: تعذر العثور على العنصر المطلوب.

# authenticationError
source: Authentication failed. Please check your credentials.
ar: فشلت المصادقة. يرجى التحقق من بيانات الاعتماد الخاصة بك.

# badRequestError
source: There was a problem with your request.
ar: كانت هناك مشكلة في طلبك.

# invalidInputError
source: The information provided is invalid. Please check and try again.
ar: المعلومات المقدمة غير صالحة. يرجى التحقق والمحاولة مرة أخرى.

# retryButtonText
source: Retry
ar: إعادة المحاولة
